articles/2020-Assi2020/Assi2020.org
#+TITLE: Data linking over RDF knowledge graphs: A survey (Review)
#+AUTHOR: Ivan Salvadori
#+LANGUAGE: en
#+EMAIL: Your email address
#+DATE: 03/07/2020
#+DESCRIPTION:Review 
#+INFOJS_OPT: path:../../HtmlTemplate/ccReport.js
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../HtmlTemplate/ccReport.css" />


#+TODO: TODO(t) STARTED(s) WAITING(w) | DONE(d) CANCELED(c)
This is a review of Assi, A., Mcheick, H., & Dhifli, W. (2020). Data linking over RDF knowledge graphs: A survey. Concurrency and Computation: Practice and Experience, (February), 1–40. https://doi.org/10.1002/cpe.5746

* STARTED Overview
The linked open data (LOD) is a space where several knowledge bases (web resources represented in RDF and expressed by ontologies) are linked to one another by typed links.
The majority of typed links are identity links, used to express that resources refer to the same real-world object (co-referring resources).
Knowledge bases (KB) made available in LOD are often created independently, containing not explicity defined co-referring resources.
As a result, each knowledge base becomes an island of isolated resource.

IM can be seen as a two-phase procedure: (i) a set of potential co-referent pairs and (ii) the use of algorithms to generate candidates.
Several categorizations of IM approaces are available in the literature such as:

 + *supervised* and *unsupervised*;
 + *domain-dependent* and *domain-independent*;
 + *schema-dependent* and *schema-independent*;
 + *local* and *global*.

This article proposes an new categorization based on the context.
It takes into consideration any information that helps to charactireze the situation of the instance, providing additional evidence to match two instances.



* STARTED Comments
This article categorizes instance matching aproaches based on the use of context.
This contribution is novel and important due to the lack in the literature of works that take into consideration different kinds of context. 

Data linking is the main subject of this review. 
However, the authors limit data linking to instance matching.
I would say that data linking is much more than linking resources that represent the same real-world object spread over multiple datasets.
Actually, there are more reasons to link resources.

According to the authors, not explicitly defining co-refences between resources of independent KBs creates island of information.
It is true, but IMHO it is not the main reason, nor the explicty definition of such relation solves this undesirable effect. 
It is hard to imagine the obligation of including an IM procedure for pubishing data.
Data island is a side effect of data publishing.
In ispite of semantic web and linked data having mechanisms to dealing with it as built in linked resources, maybe an external infrastructure responsible for handling co-referrences and other kinds of relationship would mitigate/reduce the creation of information islands.

The authors define a knowledge graph as a set of RDF statements (subject-predicate-object). 
A collection of triples for representing a soccer player is used as a example of knowledge graph. 
However, a knowledge graph is the same of a web resource.
 
