articles/2020-Assi2020/Assi2020.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 29/09/2023 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data linking over RDF knowledge graphs: A survey (Review)</title>
<meta name="author" content="Ivan Salvadori" />
<meta name="description" content="Review" />
<meta name="generator" content="Org Mode" />

<link id="tema" rel="stylesheet" type="text/css" href="../../HtmlTemplate/ccReport.css" />




</head>
<body>
<div id="content" class="content">
<h1 class="title">Data linking over RDF knowledge graphs: A survey (Review)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0e495bd">1. <span class="todo STARTED">STARTED</span> Overview</a></li>
<li><a href="#orgd9360ea">2. <span class="todo STARTED">STARTED</span> Comments</a></li>
</ul>
</div>
</div>
<p>
This is a review of Assi, A., Mcheick, H., &amp; Dhifli, W. (2020). Data linking over RDF knowledge graphs: A survey. Concurrency and Computation: Practice and Experience, (February), 1–40. <a href="https://doi.org/10.1002/cpe.5746">https://doi.org/10.1002/cpe.5746</a>
</p>

<div id="outline-container-org0e495bd" class="outline-2">
<h2 id="org0e495bd"><span class="section-number-2">1.</span> <span class="todo STARTED">STARTED</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
The linked open data (LOD) is a space where several knowledge bases (web resources represented in RDF and expressed by ontologies) are linked to one another by typed links.
The majority of typed links are identity links, used to express that resources refer to the same real-world object (co-referring resources).
Knowledge bases (KB) made available in LOD are often created independently, containing not explicity defined co-referring resources.
As a result, each knowledge base becomes an island of isolated resource.
</p>

<p>
IM can be seen as a two-phase procedure: (i) a set of potential co-referent pairs and (ii) the use of algorithms to generate candidates.
Several categorizations of IM approaces are available in the literature such as:
</p>

<ul class="org-ul">
<li><b>supervised</b> and <b>unsupervised</b>;</li>
<li><b>domain-dependent</b> and <b>domain-independent</b>;</li>
<li><b>schema-dependent</b> and <b>schema-independent</b>;</li>
<li><b>local</b> and <b>global</b>.</li>
</ul>

<p>
This article proposes an new categorization based on the context.
It takes into consideration any information that helps to charactireze the situation of the instance, providing additional evidence to match two instances.
</p>
</div>
</div>



<div id="outline-container-orgd9360ea" class="outline-2">
<h2 id="orgd9360ea"><span class="section-number-2">2.</span> <span class="todo STARTED">STARTED</span> Comments</h2>
<div class="outline-text-2" id="text-2">
<p>
This article categorizes instance matching aproaches based on the use of context.
This contribution is novel and important due to the lack in the literature of works that take into consideration different kinds of context. 
</p>

<p>
Data linking is the main subject of this review. 
However, the authors limit data linking to instance matching.
I would say that data linking is much more than linking resources that represent the same real-world object spread over multiple datasets.
Actually, there are more reasons to link resources.
</p>

<p>
According to the authors, not explicitly defining co-refences between resources of independent KBs creates island of information.
It is true, but IMHO it is not the main reason, nor the explicty definition of such relation solves this undesirable effect. 
It is hard to imagine the obligation of including an IM procedure for pubishing data.
Data island is a side effect of data publishing.
In ispite of semantic web and linked data having mechanisms to dealing with it as built in linked resources, maybe an external infrastructure responsible for handling co-referrences and other kinds of relationship would mitigate/reduce the creation of information islands.
</p>

<p>
The authors define a knowledge graph as a set of RDF statements (subject-predicate-object). 
A collection of triples for representing a soccer player is used as a example of knowledge graph. 
However, a knowledge graph is the same of a web resource.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 03/07/2020</p>
<p class="author">Author: Ivan Salvadori</p>
<p class="date">Created: 29/09/2023</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>